RomanTheLegend/FlySight-vscode/STM32_WPAN/App/app_ble.c
          /* search AD TYPE 0x09 (Complete Local Name) */
          /* search AD Type 0x02 (16 bits UUIDS) */
          if (event_type == ADV_IND || event_type == SCAN_RSP)
          {
            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              adtype = adv_report_data[k + 1];
              if (adtype == AD_TYPE_COMPLETE_LOCAL_NAME || adtype == AD_TYPE_SHORTENED_LOCAL_NAME)
              {
                const uint8_t *name_data = &adv_report_data[k + 2];
                uint8_t name_len = adlength - 1;

                APP_DBG_MSG("-- Found Device Name: '");
                for(int i=0; i<name_len; i++) { APP_DBG_MSG("%c", name_data[i]); }
                APP_DBG_MSG("'\n\r");

                /* Substring search: accept any device whose name contains al_id */
                if (al_id_len > 0 && name_len >= al_id_len)
                {
                  for (uint8_t i = 0; i <= name_len - al_id_len; i++)
                  {
                    if (memcmp(&name_data[i], al_id, al_id_len) == 0)
                    {
                      APP_DBG_MSG("-- Device Name contains AL_ID '%s'\n\r", al_id);
                      foundDeviceName = 1;
                      break;
                    }
                  }
                }
              }

              k += adlength + 1;
            } /* end while(k < event_data_size) */

            if (foundDeviceName)
            {
                APP_DBG_MSG("-- Found matching ActiveLook device!\n\r");
                BleApplicationContext.EndDevice1Found = 0x01;
                // Store the BD Address and address type of this device
                s_peer_addr_type = le_advertising_event->Advertising_Report[0].Address_Type;
                P2P_SERVER1_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
                P2P_SERVER1_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
                P2P_SERVER1_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
                P2P_SERVER1_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
                P2P_SERVER1_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
                P2P_SERVER1_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];

                APP_DBG_MSG("   Address: %02X:%02X:%02X:%02X:%02X:%02X type=%d\n\r",
                            P2P_SERVER1_BDADDR[5], P2P_SERVER1_BDADDR[4], P2P_SERVER1_BDADDR[3],
                            P2P_SERVER1_BDADDR[2], P2P_SERVER1_BDADDR[1], P2P_SERVER1_BDADDR[0],
                            s_peer_addr_type);
            }
          } /* end if (event_type == ADV_IND) */
          break;

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */

        /**
         * SPECIFIC to Custom Template APP
         */
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
          {
            /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

            /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
            pr = (aci_l2cap_connection_update_req_event_rp0 *) p_blecore_evt->data;
            result = aci_l2cap_connection_parameter_update_resp(pr->Connection_Handle,
                                                                pr->Interval_Min,
                                                                pr->Interval_Max,
                                                                pr->Latency,
                                                                pr->Timeout_Multiplier,
                                                                CONN_L1,
                                                                CONN_L2,
																pr->Identifier,
                                                                0x00);
            APP_DBG_MSG("\r\n\r** NO UPDATE \n\r");
            if(result != BLE_STATUS_SUCCESS)
            {
              /* USER CODE BEGIN BLE_STATUS_SUCCESS */

              /* USER CODE END BLE_STATUS_SUCCESS */
            }
          }
          break;

        case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
#if (L2CAP_REQUEST_NEW_CONN_PARAM != 0)
          mutex = 1;
#endif /* L2CAP_REQUEST_NEW_CONN_PARAM != 0 */
          /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_RESP */
          break;

        case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
          {
            /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

            /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
            aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) p_blecore_evt->data;
            /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
            if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
                && gap_evt_proc_complete->Status == 0x00)
            {
              /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */

              /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */

              APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n\r");
              /*if a device found, connect to it, device 1 being chosen first if both found*/
              if (BleApplicationContext.EndDevice1Found == 0x01
                  && BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED)
              {
                APP_DBG_MSG("-- Setting task CFG_TASK_CONN_DEV_1_ID\n\r");
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
              }
              else if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED
                       && FS_Config_Get()->hud_mode != 0)
              {
                /* Device not found this scan window — retry until it comes back */
                APP_DBG_MSG("-- ActiveLook device not found, retrying scan\n\r");
                UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_0);
              }
#if (CFG_P2P_DEMO_MULTI != 0)
              /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */

              /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
#endif
            }
          }
          break; /* ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE */

#if (RADIO_ACTIVITY_EVENT != 0)
        case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
          /* USER CODE BEGIN RADIO_ACTIVITY_EVENT*/

          /* USER CODE END RADIO_ACTIVITY_EVENT*/
          break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
#endif /* RADIO_ACTIVITY_EVENT != 0 */

        /* PAIRING */
        case (ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE):
          APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
          /* USER CODE BEGIN ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE*/

